 IDENTIFICATION DIVISION.
 PROGRAM-ID. FIZZBUZZ.
 
 DATA DIVISION.
 WORKING-STORAGE SECTION.
 
 01 NUM PIC 999.
 01 COUNTER PIC 999.
 01 XTEMP1 PIC 999.
 01 XREM1 PIC 999.
 01 XTEMP2 PIC 999.
 01 XREM2 PIC 999.
 01 TST PIC 9 VALUE 0.
 PROCEDURE DIVISION.
 
 DISPLAY "ENTER NUMBER: " WITH NO ADVANCING.
 ACCEPT NUM.
 
 
 100-Main-Routine.
		Perform COUNT-ROUT Varying Counter
		From 1 By 1 Until Counter = NUM.	
	Stop Run.
 COUNT-ROUT.
 PERFORM DIVI.		
 DIVI.
 	DIVIDE COUNTER BY 3 GIVING XTEMP1 REMAINDER XREM1.
 	DIVIDE COUNTER BY 5 GIVING XTEMP2 REMAINDER XREM2.
 	IF XREM1 EQUAL 0 AND XREM2 EQUAL 0
 			DISPLAY "FIZZBUZZ"
 			MOVE 1 TO TST
 		END-IF.
 		
 		IF XREM1 = 0 AND TST = 0
 			DISPLAY "FIZZ"
 		END-IF.
 		IF XREM2 = 0 AND TST = 0
 			DISPLAY "BUZZ"
 		END-IF.
 		
 		
 		IF XREM1 NOT EQUAL 0 AND XREM2 NOT EQUAL 0
 			DISPLAY COUNTER
 		END-IF.	
